Tekla.Structures.DrawingInternal.DrawingConversions
A static class that provides useful helper tool(s) for drawings.

Tekla.Structures.DrawingInternal.DrawingConversions.GetDrawingRuntimeIdFromFilename(System.String)
This function returns the drawing runtime Id given the drawings filename.
drawingFilename: Filename of the drawing (not the full path!).